// ===================== ADDITIONAL ========================== //
// // == task-1 == //
// Створити простенький калькулятор за допомогою класу.

// Цей клас буде мати такі методи:

// 1. Метод що запитує в користувача 2 числа
// 2. Метод що додає ці числа
// 3. Метод що віднімає ці числа
// 4. Метод що перемножує ці числа
// 5. Метод що ділить ці числа
// 6. Метод що виводить результат арефметичної операції на екран в форматі `Результат операції ${value}`
// цей метод запускаєтьсяв кінці кожного з методів 2-5
// 7. Метод що додає в калькулятор новий функціонал (Приймає аргументом колбек в якому описаний новий метод)
// 8. Передати в метод №7 колбек ф-ю що підносить числа в степінь
// 9. Написати всі методи і перевірити чи вони працюють


// // == task-2 == //
// Створити класи Library та Book

// 1. Клас Library буде описувати нашу бібліотеку книжок. Всі книжки будуть зберігатися в масиві.
// Також цей клас буде мати такі методи:

// - Метод buy - це метод що приймає аргументом обєкт книги і додає її в бібліотеку якщо її там ще немає. Якщо книга вже є показує повідомлення що книга вже куплена
// - Метод sell - це метод що приймає аргументом назву книги і видаляє її з бібліотеки
// - Метод addToFavourite - це метод що приймає аргументом назву книги і додає обєкт книги в список улюблених
// - Метод removeFromFavourite - це метод що приймає назву книги і видаляє її з списку улюблених
// - Гетер сountFavouriteBooks - це гетер що показує кількість книжок що додані в улюблені
// - Гетер finishedBook - це гетер що містить колекцію всіх прочитаних книжок
// - Метод totalCost - це метод що рахує вартість всіх книжок в бібліотеці

// 2. Клас Book буде описувати окрему книгу. Кожна книга це буде обєкт з такими ключами
// - author
// - title
// - price
// - totalPages
// - currentPage

// Також цей клас буде мати такі методи:

// - Метод read - це метод що приймає кількість сторінок що було прочитано і міняє значення currentPage
// - Гетер bookProgres - гетер що переводить кількість прочитаних сторінок в відсотки
// - Сетер bookProgres - сетер що переводить відсоток прочитаних сторінок в кількість
// Клас Book приймає один аргумент - обєкт з парметрами книги. В середині класу використовувати деструктуризацію обєкта