// ===================== ADDITIONAL ========================== //
// == task-1 == //
// Объявите две переменные: admin и name.
// Запишите строку "Джон" в переменную name.
// Скопируйте значение из переменной name в admin.
// Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).

// == task-2 == //
// Завдання: Написати програму яка буде перевіряти чи рік народження користувача був високосним
// Наприклад: 2000, 2004, 2016 - високосні 1998, 2002, 1900 2100 - не високосні

// == task-3 == //
// Написати програму де компютер загадає число від 1 до 10 і запропонує користувачу вгадати його Користувач вводить свій варіант і отримує результат (Виграв чи ні) Вивести результат в форматі "Вітаю ви вгадали число (тут варіант компютера)" або "Ви програли, компютер загадав (тут варіант компютера)"

// == task-4 == //
// Написати програму яка буде знаходити суму, різницю, добуток, частрку двох чисел Користувач вводить 2 числа потім вводить знак операції і отримує результат в форматі "Сума чисел a i b = результат" (такий шаблон для кожної відповіді)

// == task-5 == //
// Написати програму яка буде переводити температуру з цельсія в фаренгейти, або навпаки з фаренгейта в цельсії

// == task-6 == //
// Написати програму яка перевіряє чи введене число потрапляє в діапазон від 55 до 99 включно

// == task-7 == //
// Написати програму де користувач вводить 3 числа, після вводу всіх трьох чисел йому на екрані показується найбільше з них. Додатково перевіряти чи це взагалі числа

// == task-8 == //
// Написати програму яка переведе введену оцінку студента до болонського формату 89 - 100 це A 75 - 88 це В 60 - 74 це С 45 - 59 це D 20 - 44 це Е до 20 це F

// == task-9 == //
// Написати програму яка отримає від користувача число (кількість хвилин) і виведе на екран строку в форматі години і хвилини Приклад 70 покаже 1:10 450 покаже 7:30 1441 покаже 24:1

// == task-10 == //
// Написати гру камінь ножиці папір. Де компютер загадує своє значення потім користувач вводить свій варіант і далі ми бачимо результат на екпані хто виграв

// && ищет true до конца или спотыкается на первом false
console.log(1 && true && "js"); // js
console.log(0 && true && "js"); // 0
console.log(1 && false && "js"); // false
console.log(1 && "false" && "js"); // js

// || ищет false до конца или спотыкается на первом true
console.log(0 || false || "" || "1"); // 1
console.log(0 || false || "" || undefined); // undefined
console.log(1 || true || "fff" || undefined); // 1
console.log(0 || true || "" || undefined); // true

let userAge = 23;
if (userAge >= 20 && userAge <= 30) {
  console.log("Возраст пользователья от 20 до 30 лет");
}
userAge = 32;
if (userAge >= 20 || userAge <= 30) {
  console.log("Возраст пользователья от 20 до 30 лет");
}
